tutorials/floatRigidBody/floatRigidBody_monolithic_nOuter8/0.orig/beamone/W
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      W;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
40
(
(7.30509501724e-05 9.99965011364e-16 -0.00012070372301)
(0.000218147001151 9.99914359668e-16 -0.000360307201081)
(0.000360463392288 9.9987923798e-16 -0.000594950094891)
(0.000498621301189 9.99857591864e-16 -0.000822197335112)
(0.000631546549932 9.99847927625e-16 -0.00104017617911)
(0.000758400658025 9.99848705475e-16 -0.00124745161239)
(0.00087852795377 9.9985809831e-16 -0.00144292903904)
(0.00099141483913 9.99873894414e-16 -0.0016257784064)
...
)
;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    right
    {
        displacementSeries 
{
        file            "$FOAM_CASE/constant/timeVsDisplacement";
        outOfBounds     clamp;
}
        type            fixedValue;
        value           uniform (0 0 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
