tutorials/floatRigidBody/floatRigidBody_monolithic_nOuter8/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }
    outlet
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }
    stationaryWalls
    {
        type            fixedFluxExtrapolatedPressure;
    }
   ground
    {
        type            fixedFluxExtrapolatedPressure;
    }
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }
        floatingObject
    {
        type            fixedFluxExtrapolatedPressure;
	}
}

// ************************************************************************* //
